## Stepik - Интерактивный тренажер по SQL

In [23]:
import pandas as pd 
from sqlalchemy import create_engine


engine = create_engine(
    "postgresql://postgres:Alex84032623354!@localhost:5432/postgres"
)

df = pd.read_sql("SELECT * FROM book", engine)
df

   book_id                  title            author   price  amount
0        1     Мастер и Маргарита     Булгаков М.А.  670.99       3
1        2          Белая гвардия     Булгаков М.А.  540.50       5
2        3                  Идиот  Достоевский Ф.М.  460.00      10
3        4      Братья Карамазовы  Достоевский Ф.М.  799.01       3
4        5                  Игрок  Достоевский Ф.М.  480.50      10
5        6  Стихотворения и поэмы       Есенин С.А.  650.00      15
6        7         Евгений Онегин       Пушкин А.С.  610.00      10

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   book_id  7 non-null      int64
 1   title    7 non-null      object
 2   author   7 non-null      object
 3   price    7 non-null      float64
 4   amount   7 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 412.0+ bytes

In [25]:
df.describe()

        book_id       price     amount
count  7.000000    7.000000   7.000000
mean   4.000000  601.571429   8.000000
std    2.160247  118.776944   4.472136
min    1.000000  460.000000   3.000000
25%    2.500000  510.500000   4.000000
50%    4.000000  610.000000  10.000000
75%    5.500000  660.495000  10.000000
max    7.000000  799.010000  15.000000

In [ ]:
df2 = pd.read_sql("""SELECT
    title,
    author,
    amount,
    (SELECT MAX(amount) FROM book) - amount AS Заказ
FROM book
WHERE amount < (SELECT MAX(amount) FROM book)""", engine)       
df2 # Вывести название книги, автора, количество экземпляров в наличии и 
# сколько нужно заказать до максимального количества экземпляров
# для всех книг, у которых количество экземпляров меньше максимального
#  количества экземпляров среди всех книг

                title            author  amount  Заказ
0  Мастер и Маргарита     Булгаков М.А.       3     12
1       Белая гвардия     Булгаков М.А.       5     10
2               Идиот  Достоевский Ф.М.      10      5
3   Братья Карамазовы  Достоевский Ф.М.       3     12
4               Игрок  Достоевский Ф.М.      10      5
5      Евгений Онегин       Пушкин А.С.      10      5

In [28]:
df1 = pd.read_sql("""SELECT author, title, price
FROM book
WHERE price <= (
    SELECT AVG(price)
    FROM book)
ORDER BY price DESC""", engine)
df1 # Вывести автора, название и цену всех книг, цена которых меньше
#  или равна средней цене всех книг, отсортировав результат по убыванию цены

             author          title  price
0     Булгаков М.А.  Белая гвардия  540.5
1  Достоевский Ф.М.          Игрок  480.5
2  Достоевский Ф.М.          Идиот  460.0